In [9]:
import pandas as pd

In [10]:
voos = pd.read_csv('../../data/aulas/voos.csv')

In [11]:
voos.head()

   year month  passengers
0  1949   Jan         112
1  1949   Feb         118
2  1949   Mar         132
3  1949   Apr         129
4  1949   May         121

In [13]:
pd.pivot_table(voos, index=['year', 'month'])

            passengers
year month
1949 Apr           129
     Aug           148
     Dec           118
     Feb           118
     Jan           112
...                ...
1960 Mar           419
     May           472
     Nov           390
     Oct           461
     Sep           508

[144 rows x 1 columns]

In [14]:
pd.pivot_table(voos, index=['month', 'year'])

            passengers
month year
Apr   1949         129
      1950         135
      1951         163
      1952         181
      1953         235
...                ...
Sep   1956         355
      1957         404
      1958         404
      1959         463
      1960         508

[144 rows x 1 columns]

In [16]:
voos_por_ano = voos.groupby('year')

In [18]:
voos_por_ano.describe()

     passengers
          count        mean        std    min     25%    50%     75%    max
year
1949       12.0  126.666667  13.720147  104.0  118.00  125.0  135.25  148.0
1950       12.0  139.666667  19.070841  114.0  125.75  137.5  151.25  170.0
1951       12.0  170.166667  18.438267  145.0  159.00  169.0  179.50  199.0
1952       12.0  197.000000  22.966379  171.0  180.75  192.0  211.25  242.0
1953       12.0  225.000000  28.466887  180.0  199.75  232.0  238.50  272.0
1954       12.0  238.916667  34.924486  188.0  221.25  231.5  260.25  302.0
1955       12.0  284.000000  42.140458  233.0  260.75  272.0  312.75  364.0
1956       12.0  328.250000  47.861780  271.0  300.50  315.0  359.75  413.0
1957       12.0  368.416667  57.890898  301.0  330.75  351.5  408.50  467.0
1958       12.0  381.000000  64.530472  310.0  339.25  360.5  411.75  505.0
1959       12.0  428.333333  69.830097  342.0  387.50  406.5  465.25  559.0
1960       12.0  476.166667  77.737125  390.0  418.50  461.0  514.75  622.0

In [20]:
voos_por_ano['passengers'].mean()

year
1949    126.666667
1950    139.666667
1951    170.166667
1952    197.000000
1953    225.000000
1954    238.916667
1955    284.000000
1956    328.250000
1957    368.416667
1958    381.000000
1959    428.333333
1960    476.166667
Name: passengers, dtype: float64

In [21]:
voos_por_mes = voos.groupby('month')
voos_por_mes

In [22]:
voos_por_mes.describe()

       year                                                              \
      count    mean       std     min      25%     50%      75%     max
month
Apr    12.0  1954.5  3.605551  1949.0  1951.75  1954.5  1957.25  1960.0
Aug    12.0  1954.5  3.605551  1949.0  1951.75  1954.5  1957.25  1960.0
Dec    12.0  1954.5  3.605551  1949.0  1951.75  1954.5  1957.25  1960.0
Feb    12.0  1954.5  3.605551  1949.0  1951.75  1954.5  1957.25  1960.0
Jan    12.0  1954.5  3.605551  1949.0  1951.75  1954.5  1957.25  1960.0
Jul    12.0  1954.5  3.605551  1949.0  1951.75  1954.5  1957.25  1960.0
Jun    12.0  1954.5  3.605551  1949.0  1951.75  1954.5  1957.25  1960.0
Mar    12.0  1954.5  3.605551  1949.0  1951.75  1954.5  1957.25  1960.0
May    12.0  1954.5  3.605551  1949.0  1951.75  1954.5  1957.25  1960.0
Nov    12.0  1954.5  3.605551  1949.0  1951.75  1954.5  1957.25  1960.0
Oct    12.0  1954.5  3.605551  1949.0  1951.75  1954.5  1957.25  1960.0
Sep    12.0  1954.5  3.605551  1949.0  1951.75  1954.5  1957.25  1960.0

      passengers
           count        mean         std    min     25%    50%     75%    max
month
Apr         12.0  267.083333  107.374839  129.0  176.50  252.0  348.00  461.0
Aug         12.0  351.083333  155.783333  148.0  231.25  320.0  476.50  606.0
Dec         12.0  261.833333  103.093808  118.0  187.00  253.5  336.25  432.0
Feb         12.0  235.000000   89.619397  118.0  172.50  214.5  305.25  391.0
Jan         12.0  241.750000  101.032960  112.0  164.50  223.0  321.25  417.0
Jul         12.0  351.333333  156.827255  148.0  222.25  333.0  471.50  622.0
Jun         12.0  311.666667  134.219856  135.0  208.00  289.5  425.25  535.0
Mar         12.0  270.166667  100.559194  132.0  189.25  251.5  357.50  419.0
May         12.0  271.833333  114.739890  121.0  180.25  252.0  357.00  472.0
Nov         12.0  232.833333   95.185783  104.0  165.50  220.0  306.25  390.0
Oct         12.0  266.583333  110.744964  119.0  183.75  251.5  350.00  461.0
Sep         12.0  302.416667  123.954140  136.0  202.75  285.5  404.00  508.0

In [24]:
voos_por_mes['passengers'].mean()

month
Apr    267.083333
Aug    351.083333
Dec    261.833333
Feb    235.000000
Jan    241.750000
Jul    351.333333
Jun    311.666667
Mar    270.166667
May    271.833333
Nov    232.833333
Oct    266.583333
Sep    302.416667
Name: passengers, dtype: float64

In [26]:
pd.pivot_table(voos, index=['month', 'year']).transpose()

month       Apr                                               ...  Sep       \
year       1949 1950 1951 1952 1953 1954 1955 1956 1957 1958  ... 1951 1952
passengers  129  135  163  181  235  227  269  313  348  348  ...  184  209

month
year       1953 1954 1955 1956 1957 1958 1959 1960
passengers  237  259  312  355  404  404  463  508

[1 rows x 144 columns]

In [27]:
voos.transpose()

,0,1,2,3,4,5,6,7,8,9,...,134,135,136,137,138,139,140,141,142,143
year,1949,1949,1949,1949,1949,1949,1949,1949,1949,1949,...,1960,1960,1960,1960,1960,1960,1960,1960,1960,1960
month,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,...,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec
passengers,112,118,132,129,121,135,148,148,136,119,...,419,461,472,535,622,606,508,461,390,432